// пробел - 2 бита
export const SPACE = '11'

export const dict = {
    '.': '00000', // 1
    ',': '00001', // 2

    'о': '00010', // 3
    'е': '00011', // 4
    'а': '00100', // 5
    'и': '00101', // 6
    'н': '00110', // 7
    'т': '00111', // 8
    'с': '01000', // 9
    'р': '01001', // 10
    'в': '01010', // 11
    'л': '01011', // 12
    'к': '01100', // 13
    'м': '01101', // 14
    'д': '01110', // 15
    'п': '01111', // 16
    'у': '10000', // 17
    'я': '10001', // 18
    'ы': '10010', // 19
    'ь': '10011', // 20

    'NUMBER_CONTROL': '10100', // одна цифра дальше
    'SYMBOL_CONTROL': '10101', // знак препинания дальше
    'CONTROLS_DICT_CONTROL': '10110', // управляющие комбинации
}

export const controlsDict = {
    'NUM_MODE_CONTROL': '101100', // числовой режим (переключатель)
    'CAPS_CONTROL': '101110', // одна буква капсом дальше
    'CAPS_MODE_CONTROL': '101111', // капс-режим (переключатель)
}

export const extendedDict = {
    'г': '0000',
    'з': '0001',
    'б': '0010',
    'ч': '0011',
    'й': '0100',
    'х': '0101',
    'ж': '0110',
    'ш': '0111',
    'ю': '1000',
    'ц': '1001',
    'щ': '1010',
    "э": "1011",
    "ф": "1100",
    "ъ": "1101",
    "ё": "1111",
}

export const digits = {
    '0': '0000',
    '1': '0001',
    '2': '0010',
    '3': '0011',
    '4': '0100',
    '5': '0101',
    '6': '0110',
    '7': '0111',
    '8': '1000',
    '9': '1001',
    'STOP_NUM_MODE': '1111'
}

export const symbols = {
    ':': '0000',
    ';': '0001',
    '…': '0010',
    '?': '0011',
    '!': '0100',
    '-': '0101',
    '\"': '0110',
    '(': '0111',
    ')': '1000',
    '/': '1001',
    '%': '1010',
    '$': '1011',
    '\t': '1100',
    '\n': '1101',

    // '': '1110',
    // '': '1111',
}